In [3]:
import pandas as pd
employee = pd.read_table('/Users/ryanheadley/Documents/GitHub/Development/Udemy/Learn Data Analysis using Pandas and Python (2|3)/ressources/DataTables example - Tab separated values.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [25]:
#concatenating 2 columns
employee['Name Salary'] = employee['Name'] + employee['Salary']
employee.head()

,Name,Position,Office,Age,Start date,Salary,Name Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700","Airi Satou$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000","Angelica Ramos$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000","Ashton Cox$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000","Bradley Greer$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850","Brenden Wagner$206,850"

In [26]:
#delete column
employee.drop('Office', axis=1, inplace=True)
employee.head()

,Name,Position,Age,Start date,Salary,Name Salary
0,Airi Satou,Accountant,33,2008/11/28,"$162,700","Airi Satou$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),47,2009/10/09,"$1,200,000","Angelica Ramos$1,200,000"
2,Ashton Cox,Junior Technical Author,66,2009/01/12,"$86,000","Ashton Cox$86,000"
3,Bradley Greer,Software Engineer,41,2012/10/13,"$132,000","Bradley Greer$132,000"
4,Brenden Wagner,Software Engineer,28,2011/06/07,"$206,850","Brenden Wagner$206,850"

In [7]:
#sort table by age
employee.sort_values(by='Age', ascending=True).head()

,Name,Position,Office,Age,Start date,Salary
48,Tatyana Fitzpatrick,Regional Director,London,19,2010/03/17,"$385,750"
45,Shou Itou,Regional Marketing,Tokyo,20,2011/08/14,"$163,000"
7,Caesar Vance,Pre-Sales Support,New York,21,2011/12/12,"$106,450"
32,Lael Greer,Systems Administrator,London,21,2009/02/27,"$103,500"
18,Gavin Cortez,Team Leader,San Francisco,22,2008/10/26,"$235,500"

In [8]:
#sorting a series
employee['Name'].sort_values().head()

0        Airi Satou
1    Angelica Ramos
2        Ashton Cox
3     Bradley Greer
4    Brenden Wagner
Name: Name, dtype: object

In [10]:
#filter using where clause
employee[employee.Age < 40].head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"
6,Bruno Nash,Software Engineer,London,38,2011/05/03,"$163,500"
7,Caesar Vance,Pre-Sales Support,New York,21,2011/12/12,"$106,450"
9,Cedric Kelly,Senior Javascript Developer,Edinburgh,22,2012/03/29,"$433,060"

In [11]:
employee[(employee.Age < 40) & (employee.Name == "Airi Satou")]

         Name    Position Office  Age  Start date    Salary
0  Airi Satou  Accountant  Tokyo   33  2008/11/28  $162,700

In [12]:
#calculate mean
employee.mean()

Age    42.736842
dtype: float64

In [14]:
#string manipulation
employee.Name.str.upper().head()

0        AIRI SATOU
1    ANGELICA RAMOS
2        ASHTON COX
3     BRADLEY GREER
4    BRENDEN WAGNER
Name: Name, dtype: object

In [16]:
#searching for strings
employee.Position.str.contains('Software').head()

0    False
1    False
2    False
3     True
4     True
Name: Position, dtype: bool

In [18]:
employee[employee.Position.str.contains('Software')].head()

,Name,Position,Office,Age,Start date,Salary
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"
6,Bruno Nash,Software Engineer,London,38,2011/05/03,"$163,500"
46,Sonya Frost,Software Engineer,Edinburgh,23,2008/12/13,"$103,600"
55,Zenaida Frank,Software Engineer,New York,63,2010/01/04,"$125,250"

In [19]:
#replacing strings
employee.Position.str.replace('Engineer','Developer').head()

0                       Accountant
1    Chief Executive Officer (CEO)
2          Junior Technical Author
3               Software Developer
4               Software Developer
Name: Position, dtype: object

In [20]:
#aggregations
employee.Age.min()

19

In [23]:
#group by clause
employee.groupby('Position').Age.min().head()

Position
Accountant                       33
Chief Executive Officer (CEO)    47
Chief Financial Officer (CFO)    64
Chief Marketing Officer (CMO)    40
Chief Operating Officer (COO)    48
Name: Age, dtype: int64

In [24]:
#list of aggregations
employee.groupby('Position').Age.agg(['count','min','max']).head()

                               count  min  max
Position
Accountant                         2   33   63
Chief Executive Officer (CEO)      1   47   47
Chief Financial Officer (CFO)      1   64   64
Chief Marketing Officer (CMO)      1   40   40
Chief Operating Officer (COO)      1   48   48